{"data":{"site":{"siteMetadata":{"title":"Ryshe Blog","author":"Ryan Sheehan"}},"markdownRemark":{"id":"0227948c-02a2-5757-8774-4fc532aab5d7","excerpt":"MotivationStarting my own personal site has been on my todo list for quite some time. Not\nonly have I been a professional software engineer for over 10 years…","html":"<h2>Motivation</h2>\n<p>Starting my own personal site has been on my todo list for quite some time. Not\nonly have I been a professional software engineer for over 10 years, but I have\nspent some time as a professional scrum master.  Over the years I have\naccumulated many hard earned lessons that I think are worth sharing.</p>\n<p>Not only do I wish to share my thoughts, but I believe writing is the next\nappropriate step in my career.  Leadership is something I have always been\ninterested, and for a while now, my career has straddled this line between\nsoftware engineering and software development leadership.  To keep pushing my\ncareer forward, I need present my thoughts and ideas to larger audiences.</p>\n<p>Finally, I like to tinker with code!  A personal site would serve as an\nexcellent portfolio to any little side projects I put together; including this\nsite!</p>\n<h2>Fears</h2>\n<p>It’s always a little scary to put your ideas out to the world for criticism, but\nI believe it is in discourse that great ideas rise to the top.  Arguably, one of\nmy best qualities is being forthcoming with opinions.  I believe that having to\njustify your ideas to those both smarter than yourself, and to those that are\ninexperienced and naive, is a great way to solidify and revalidate your\nopinions.</p>\n<p>Another fear is not being able to keep up with writing.  Time is a commodity\nthat is not bountiful for me.  I expect to fall off the wagon with regular\nwriting, but it’s important to keep returning to writing.</p>\n<p>My last fear is about maintenance.  Should I be able to write regularly there is\nthe potential the old ideas will not get updated.  My thoughts and ideas evolve,\nand I wouldn’t want outdated thoughts to define this site.</p>\n<h2>Plans</h2>\n<p>In order to keep the motivation for writing, I believe I’ll need to maintain a\ntopic list.  That way when it comes time to write, I don’t have to first think\nabout a topic.  If I am not writing about a topic, I plan to journal progress on\nany ongoing side projects.  My initial goal is to write one post per month.\nBeing regular will be critical to forming my writing habit.</p>\n<p>Initially, I expect, my posts will be about getting this site up and running.\nDocumenting my thoughts about managing development projects, on a professional\nlevel, will quickly follow.  I expect a bumpy ride to start, but I’m looking\nforward to building up this site!</p>","frontmatter":{"title":"Launching the Blog","date":"May 01, 2019","description":"This is the inaugural post to kick off my personal site"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/launching-the-blog/launching-the-blog/","previous":null,"next":null}}